[
  {
    "slug": "floor",
    "name": "Floor",
    "display_order": 1,
    "description": "The floor cabinet is the standard form factor of the pinball machine: a full-sized, free-standing unit roughly six feet long, two feet wide, and five feet tall at the backbox, weighing between 200 and 300 pounds. The player stands at the front, operating flipper buttons mounted on either side of the cabinet, while the playfield tilts away at roughly six and a half degrees. A vertical backbox rises from the rear, housing the scoring display and translite artwork that gives each machine its visual identity.\n\nThe basic proportions of the floor cabinet have remained remarkably stable since the 1950s. Playfield dimensions settled around 20.25 by 42 inches — a size dictated as much by the width of doorways and the capacity of delivery trucks as by any design principle. Widebody machines, roughly four inches wider, appeared periodically when designers needed more playfield real estate, but the standard body remained the overwhelming default. The cabinet's height, depth, and leg geometry were optimized for a standing adult player, and the slight forward lean required to see the playfield and reach the flipper buttons became part of the physical vocabulary of playing pinball.\n\nEvery major era of pinball — from the electromechanical golden age through solid-state, dot-matrix, and LCD — has been built primarily around the floor cabinet. It is the form factor that operators, collectors, and players mean when they say \"pinball machine\" without further qualification."
  },
  {
    "slug": "tabletop",
    "name": "Tabletop",
    "display_order": 2,
    "description": "Tabletop pinball machines are miniaturized versions of full-sized games, designed to sit on a table, counter, or other flat surface at a comfortable playing height. They typically range from two to four feet in length and weigh between 30 and 80 pounds — small enough for two people to carry, large enough to preserve meaningful playfield geometry. The backbox is either integrated into the cabinet or significantly reduced in size, and the legs are absent entirely.\n\nThe tabletop format appeared early in pinball's history, with manufacturers producing smaller games for locations that couldn't accommodate a full floor model — small shops, private homes, ship galleys, military recreation rooms. Gottlieb, Williams, and Bally all produced tabletop models at various points, sometimes as dedicated designs and sometimes as scaled-down versions of popular floor games. The format experienced periodic revivals, notably in the home-market push of the late 1970s and early 1980s when manufacturers sought to sell directly to consumers.\n\nTabletop machines occupy a space between the full arcade experience of a floor cabinet and the toy-like miniaturization of handheld games. At their best, they deliver genuine pinball gameplay — real flippers, real steel balls, real solenoid-driven bumpers — in a package that fits in a living room or a dorm. At their worst, they sacrifice too much playfield complexity to the constraints of the smaller format and feel like compromises rather than complete games."
  },
  {
    "slug": "countertop",
    "name": "Countertop",
    "display_order": 3,
    "description": "Countertop machines are the smallest coin-operated amusement format: compact cabinets designed to sit on a bar, lunch counter, or store checkout and earn revenue in spaces where a floor model would never fit. They are typically under two feet long and light enough for one person to move, with a coin mechanism built into the cabinet and a playfield just large enough to support a few scoring features. Many early countertop games predated the flipper entirely, operating as pure bagatelle — plunger, pins, holes, gravity.\n\nThe countertop format was critical to the early expansion of the coin-operated amusement industry in the 1930s. Manufacturers like Gottlieb, Genco, and Bally produced countertop games by the thousands, placing them in drugstores, cigar shops, candy stores, and diners where they earned pennies and nickels from customers waiting for a prescription or a sandwich. The low cost of the machines and the low commitment required from the location owner made countertop games the entry point for an industry that would grow into the arcade era.\n\nAs pinball matured and playfield complexity increased through the 1940s and 1950s, the countertop format gradually gave way to the floor cabinet that could accommodate more features, more targets, and eventually more flippers. Countertop games persisted in novelty and trade-stimulator niches, but the mainstream of pinball design moved decisively to the floor. The countertop remains historically significant as the format that first proved coin-operated amusement could sustain a national industry."
  },
  {
    "slug": "cocktail",
    "name": "Cocktail",
    "display_order": 4,
    "description": "Cocktail cabinets are horizontal, table-height units with a flat glass top, designed so players look down onto the playfield from above while seated. The format takes its name from the cocktail-table arcade cabinets popularized by video games like *Space Invaders* and *Pac-Man* in the late 1970s, and it shares their social premise: a game built into a piece of furniture, suitable for a bar or lounge where players sit with drinks rather than standing at an upright machine.\n\nApplying the cocktail format to pinball required solving the problem of a game designed around gravity on a tilted surface. Some cocktail pinball machines used a conventional tilted playfield viewed through an angled mirror or glass panel. Others placed the playfield flat and used mechanical or magnetic systems to propel the ball, fundamentally altering the physics of play. The results were mixed — the format worked well enough as a novelty, but the compromises required to fit pinball into a horizontal, seated-play cabinet inevitably changed the feel of the game.\n\nCocktail pinball machines were never produced in large numbers, and the format remains a curiosity rather than a mainstream cabinet type. OPDB tracks the cocktail table as a distinct feature, and the machines that exist are valued by collectors precisely for their rarity and their status as experiments in reimagining what a pinball machine could physically be."
  }
]
