[
  {
    "slug": "nixie-tube",
    "name": "Nixie Tube",
    "display_order": 1,
    "description": "Nixie tubes were cold-cathode gas-discharge devices, each containing a stack of ten wire-mesh numerals — zero through nine — sealed inside a glass envelope filled with neon gas. When voltage was applied to a particular cathode, the corresponding numeral glowed orange behind the glass. They were never common in pinball; only a handful of machines in the late 1960s and early 1970s used them for electronic scoring before LED seven-segment displays made them obsolete.\n\nGames like Bally's *Odds & Evens* (1973) and several European manufacturers experimented with nixie-tube scoring as a bridge between the purely mechanical scoring of the pre-electronic era and the LED displays that would arrive with the first solid-state machines. The tubes were expensive, fragile, and required high-voltage drive circuits — impractical for the rough environment of an arcade. Their warm orange glow and the visible depth of stacked numerals give them a distinctive aesthetic that no other display technology replicates.\n\nNixie-tube pinball machines are extremely rare today, and working examples command a premium among collectors who value the technology's visual character and its place as the earliest form of electronic scoring in the medium.",
    "display_type_slug": "alphanumeric"
  },
  {
    "slug": "7-segment",
    "name": "Seven-Segment",
    "display_order": 2,
    "description": "Seven-segment LED displays were the first digital scoring technology to achieve widespread adoption in pinball, arriving with the earliest solid-state machines in 1977. Each digit consisted of seven independently lit LED bars arranged in a figure-eight pattern, capable of rendering the numerals zero through nine and a limited set of letters. The displays typically glowed red or amber and were mounted behind the backglass in groups of six or seven digits per player.\n\nEvery major manufacturer used seven-segment displays during the transition from electromechanical to solid-state: Williams System 3 through System 7, Bally's AS-2518 series, Gottlieb System 1 and System 80, and Stern's MPU-100 and MPU-200 all relied on them. The technology was cheap, bright, and reliable — a dramatic improvement over the mechanical score reels it replaced, even if the blocky digits lacked the tactile charm of spinning drums.\n\nSeven-segment displays could show numbers cleanly but struggled with text. Designers worked around the limitation by using the backglass artwork and playfield inserts to communicate everything that wasn't a score. By the early 1980s, sixteen-segment alphanumeric displays had arrived, capable of rendering readable text, and seven-segment panels were phased out of new designs within a few years.",
    "display_type_slug": "alphanumeric"
  },
  {
    "slug": "16-segment",
    "name": "Sixteen-Segment",
    "display_order": 3,
    "description": "Sixteen-segment displays doubled the bar count of their seven-segment predecessors, adding diagonal and additional horizontal elements that could render the full alphabet with reasonable clarity. Bally and Williams adopted them in the early 1980s, and by 1985 they were the standard display technology for new solid-state machines. For the first time, a pinball machine could show player names, spell out mode instructions, and display high-score initials.\n\nThe characteristic amber glow of sixteen-segment displays defined an era of pinball that included some of the medium's most celebrated titles: *High Speed*, *Earthshaker*, *Cyclone*, *Taxi*, *Bride of Pinbot*. Designers used scrolling text, flashing patterns, and simple character animations to give machines personality within the constraints of the segmented format. Speech synthesis arrived around the same time, and the combination of readable text and spoken words transformed pinball from a purely mechanical experience into something that could tell stories.\n\nWilliams' WPC platform introduced the plasma dot-matrix display in 1991, and sixteen-segment alphanumeric panels disappeared from new designs almost immediately. The transition was abrupt — within a single product cycle, the entire industry moved to DMD. But sixteen-segment displays remain instantly recognizable to anyone who spent time in an arcade during the 1980s, and their warm segmented glow carries a nostalgia that pixel grids don't quite replicate.",
    "display_type_slug": "alphanumeric"
  },
  {
    "slug": "plasma-dmd",
    "name": "Plasma",
    "display_order": 4,
    "description": "The original dot-matrix displays introduced by Williams in 1991 were plasma panels — gas-discharge technology where each of the 128×32 pixels was a tiny cell of ionized neon gas that glowed orange when energized. The plasma DMD became the defining visual element of pinball's golden age, its warm monochrome glow framing the animations and character art that brought licensed themes to life in machines like *The Addams Family*, *Twilight Zone*, and *Medieval Madness*.\n\nPlasma panels had characteristics that shaped the art created for them: high contrast, wide viewing angles, and a natural warmth to the orange phosphor that read well under arcade lighting. Animators developed a distinctive aesthetic around the 128×32 resolution — chunky, high-contrast characters and bold typography designed to be legible from across a room. The low pixel count was a creative constraint that produced a recognizable visual language.\n\nWilliams, Bally, and later Stern shipped plasma DMDs through the 2000s and into the early 2010s. The panels eventually became difficult to source as the gas-discharge technology fell out of mainstream manufacturing, which contributed to the development of LED-based replacements. Working plasma panels remain prized by purists who consider their analog warmth and slight pixel bloom essential to the visual character of the machines they were designed for.",
    "display_type_slug": "dot-matrix"
  },
  {
    "slug": "color-led-dmd",
    "name": "Color LED",
    "display_order": 5,
    "description": "Color LED dot-matrix displays replace the original monochrome plasma panel with a grid of RGB LEDs capable of rendering the same 128×32 resolution in full color. What began as an aftermarket upgrade — companies like ColorDMD and Pin2DMD developed drop-in replacements for aging plasma panels — eventually became a factory option, with manufacturers shipping machines equipped with color LED DMDs or offering them as premium features on limited-edition models.\n\nThe effect is striking: animations originally designed in four shades of orange suddenly bloom with color, adding depth and vibrancy to classic games. Some implementations colorize the original animation frames algorithmically; others use hand-painted color palettes created specifically for each title. Factory color LED DMDs in machines like Stern's *The Walking Dead* Limited Edition and the *Attack from Mars* remakes were designed with color from the start.\n\nThe color LED DMD occupies an interesting position in pinball history — it preserves the low-resolution, pixel-art aesthetic of the plasma era while adding a dimension the original technology could never achieve. For collectors, it extends the life of plasma-era machines whose original panels are increasingly difficult to replace. For manufacturers, it offered a middle ground between the classic DMD format and the full LCD panels that would eventually become the industry standard.",
    "display_type_slug": "dot-matrix"
  }
]
